# Напишите программу,
# которая вычислит половину квадрата числа Пи (pi=3.14159), округлив до целого

# def rnd(num):
#     print("your rounded number:  ", round(num))
#
#
# rnd(float(input("your number:  ")))


def summ(d1, d2):
    return(d1 + d2)

a = summ(int(input("insert d1:  ")), int(input("insert d2:  ")))
print(a)
