# Alt + Ctrl + L - привести код в соответствие с PEP8

# варианты исполнения команд: интерактивный (запуск кода в консоли windows или idle) и файловый (сохранение в файл)
# все программы строятся на 4 вещах: данные, вычисления, проверка условий и циклы.

# хранилищем данных является объект (объект с числом, объект со строкой...)
# обращение к хранилищу происходит по имени ссылки на объект - это и есть переменная.
# a=7 формирует объект "7" и имя ссылки на него "а".
# a=6 формирует объект "6" и меняет имя ссылки "а" на него, после чего объект "7" удаляется.
# динамическая типизация - тип переменной определяется в момент присваивания ей значения.
# b=a приведет к тому, что и b, и a ссылаются на один объект (объект не копируется!)
# можно a=b=c=7 и print(a, b, c) даст 7 7 7, а id(a) == id(b) == id(c). id - это id объекта!
# можно a, b = b, a и поменять значения переменных друг на друга






